Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_ZShapeProfile
The IFC2X3_ParametricObject_ZShapeProfile class contains the Z-shape profile definition.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_ZShapeProfile.Depth
The depth.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_ZShapeProfile.FlangeWidth
The flange width.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_ZShapeProfile.WebThickness
The web thickness.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_ZShapeProfile.FlangeThickness
The flange thickness.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_ZShapeProfile.FilletRadius
The fillet radius.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_ZShapeProfile.EdgeRadius
The edge radius.